'''
1. Реализовать класс «Дата», функция-конструктор которого должна принимать дату в виде строки формата «день-месяц-год».
 В рамках класса реализовать два метода. Первый, с декоратором @classmethod, должен извлекать число, месяц, год и
 преобразовывать их тип к типу «Число». Второй, с декоратором @staticmethod, должен проводить валидацию числа, месяца
 и года (например, месяц — от 1 до 12). Проверить работу полученной структуры на реальных данных.
'''


class Date:

    @classmethod
    def date_to_int(cls, date):
        day = int(date[:2])
        print(f'День: {day}')
        month = int(date[3:5])
        print(f'Месяц: {month}')
        year = int(date[-4:])
        print(f'Год: {year}')

    @staticmethod
    def validation(day, month, year):
        leap_years = [1764, 1768, 1772, 1776, 1780, 1784, 1788, 1792, 1796, 1804, 1808, 1812, 1816, 1820, 1824, 1828,
                      1832, 1836, 1840, 1844, 1848, 1852, 1856, 1860, 1864, 1868, 1872, 1876, 1880, 1884, 1888, 1892,
                      1896, 1904, 1908, 1912, 1916, 1920, 1924, 1928, 1932, 1936, 1940, 1944, 1948, 1952, 1956, 1960,
                      1964, 1968, 1972, 1976, 1980, 1984, 1988, 1992, 1996, 2000, 2004, 2008, 2012, 2016, 2020, 2024,
                      2028, 2032, 2036, 2040, 2044, 2048, 2052, 2056, 2060, 2064, 2068, 2072, 2080, 2084, 2088, 2092,
                      2096, 2104, 2108, 2112, 2116, 2120, 2124, 2128, 2132]
        thirty_one_days_months = [1, 3, 5, 7, 8, 10, 12]
        thirty_days_month = [4, 6, 9, 11]
        if year in leap_years:
            print('Этот год Високосный')
        if 1 <= month <= 12:
            if 1 <= day <= 31 and month in thirty_one_days_months or 1 <= day <= 30 and month in thirty_days_month or \
                    1 <= day <= 28 and month == 2 and year not in leap_years or 1 <= day <= 29 and month == 2 and\
                    year in leap_years:
                print('Такая дата существует')
            else:
                print('Неверная дата. Несуществует такого дня в этом месяце')
        else:
            print('Такого месяца не существует')


Date.date_to_int('01-01-2001')
print('-' * 10)
Date.date_to_int('25-10-1955')
print('-' * 10)
Date.validation(12, 15, 2025)
print('-' * 10)
Date.validation(29, 2, 2025)
print('-' * 10)
Date.validation(29, 2, 1992)
print('-' * 10)
Date.validation(1, 1, 2002)
print('-' * 10)
Date.validation(30, 2, 2002)
print('-' * 10)
